In [4]:
import pandas as pd

df = pd.read_csv(r"C:\Users\klai\OneDrive - Cherry Creek School District\Desktop\Artificial_Intelligence\titanic.csv")
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [5]:
df.head(6)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [6]:
df.at[5, 'Age']=28.0
df.head(6)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,28.0,0,0,330877,8.4583,NaN,Q

In [7]:
maj=df['Age']>18
print(maj)

0       True
1       True
2       True
3       True
4       True
       ...
886     True
887     True
888    False
889     True
890     True
Name: Age, Length: 891, dtype: bool

In [30]:
count=maj.sum()
print(count, "passengers are over 18.")

576 passengers are over 18.

In [32]:
count = 0
for sekai in df['Age']:
    if sekai > 18:
        count = count +1
count

576

In [34]:
count = 0
for sekai in df['Sex']:
    if sekai == "male":
        count = count + 1
    
count = (count / len(df)) * 100
count

64.75869809203144

In [41]:
tone = 0 
for tickone in df['Pclass']:
    if tickone == 1:
        tone = tone + 1
        
ttwo = 0 
for ticktwo in df['Pclass']:
    if ticktwo == 2:
        ttwo = ttwo + 1
        
ttree = 0 
for ticktree in df['Pclass']:
    if ticktree == 3:
        ttree = ttree + 1
        
print("There were", tone, "passengers in first class,", ttwo, "in second class, and", ttree, "in third class.")

There were 216 passengers in first class, 184 in second class, and 491 in third class.

In [45]:
classes = {"CLASS":[], "Frequency":[]}
countFirst = 0
countSecond = 0
countThird = 0
for ticket in df["Pclass"]:
    if ticket == 1:
        countFirst = countFirst + 1
    elif ticket == 2:
        countSecond = countSecond + 1
    elif ticket == 3:
        countThird = countThird + 1
classes["CLASS"].append("First")
classes["CLASS"].append("Second")
classes["CLASS"].append("Third")
classes["Frequency"].append(countFirst)
classes["Frequency"].append(countSecond)
classes["Frequency"].append(countThird)
classes

{'CLASS': ['First', 'Second', 'Third'], 'Frequency': [216, 184, 491]}

In [47]:
freqTable = pd.DataFrame(classes)

In [48]:
freqTable["Percent"] = (freqTable["Frequency"] / len(df))*100
freqTable.head()

    CLASS  Frequency    Percent
0   First        216  24.242424
1  Second        184  20.650954
2   Third        491  55.106622

In [7]:
df[df["PassengerId"] == 528]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
527,528,0,1,"Farthing, Mr. John",male,NaN,0,0,PC 17483,221.7792,C95,S

In [8]:
idx = 0
for person in df ["Name"]:
    if "Fannie" in person:
        break
    idx += 1
df.loc[idx]

PassengerId                              707
Survived                                   1
Pclass                                     2
Name           Kelly, Mrs. Florence "Fannie"
Sex                                   female
Age                                     45.0
SibSp                                      0
Parch                                      0
Ticket                                223596
Fare                                    13.5
Cabin                                    NaN
Embarked                                   S
Name: 706, dtype: object

In [11]:
M = sum(df['Sex'] == 'male')
F = sum(df['Sex'] == 'female')
print(M)
print(F)

577
314

In [12]:
S = sum(df['Survived'] == 0)
D = sum(df['Survived'] == 1)
print(S)
print(D)

549
342

In [23]:
MS = 0
MD = 0
FS = 0
FD = 0

for idx in range(len(df)):
    if df.loc[idx]['Sex'] == 'male' and df.loc[idx]['Survived'] == 0:
        MD += 1
    elif df.loc[idx]['Sex'] == 'male' and df.loc[idx]['Survived'] == 1:
        MS += 1
    elif df.loc[idx]['Sex'] == 'female' and df.loc[idx]['Survived'] == 0:
        FD += 1
    elif df.loc[idx]['Sex'] == 'female' and df.loc[idx]['Survived'] == 1:
        FS += 1
        
comTable = pd.DataFrame({
    'Male': [MS, MD],
    'Female': [FS, FD]    
})
comTable.index = ['Survived', 'Died']

comTable.head()

          Male  Female
Survived   109     233
Died       468      81

In [8]:
childSurvive = 0
childDied = 0
adultSurvive = 0
adultDied = 0
elderSurvive = 0
elderDied = 0
childTotal = 0
adultTotal = 0
elderTotal = 0
allPeople = 0
allPeopleSurvive = 0
allPeopleDied = 0
for idx in range(len(df)):
    if df.loc[idx]["Age"] < 18 and df.loc[idx]["Survived"] == 1:
        childSurvive += 1
        childTotal += 1
        allPeople += 1
        allPeopleSurvive += 1
    elif df.loc[idx]['Age'] < 18 and df.loc[idx]["Survived"] == 0:
        childDied += 1
        childTotal += 1
        allPeople += 1
        allPeopleDied += 1
    elif df.loc[idx]["Age"] >= 18 and df.loc[idx]["Age"] < 60 and df.loc[idx]["Survived"] == 1:
        adultSurvive += 1
        adultTotal += 1
        allPeople += 1
        allPeopleSurvive += 1
    elif df.loc[idx]["Age"] >= 18 and df.loc[idx]["Age"] < 60 and df.loc[idx]["Survived"] == 0:
        adultDied += 1
        adultTotal += 1
        allPeople += 1
        allPeopleDied += 1
    elif df.loc[idx]['Age'] >= 60 and df.loc[idx]["Survived"] == 1:
        elderSurvive += 1
        elderTotal += 1
        allPeople += 1
        allPeopleSurvive += 1
    elif df.loc[idx]['Age'] >= 60 and df.loc[idx]["Survived"] == 0:
        elderDied += 1
        elderTotal += 1
        allPeople += 1
        allPeopleDied += 1

conTable = {
    "Child": [childSurvive/childTotal *100, childDied/childTotal *100],
    "Adult": [adultSurvive/adultTotal *100, adultDied/adultTotal *100],
    "Elderly": [elderSurvive/elderTotal *100, elderDied/elderTotal *100],
    "Total": [allPeopleSurvive/allPeople *100, allPeopleDied/allPeople*100]
}
df2 = pd.DataFrame(conTable)
df2.index = ["Survived", "Died"]
df2.head()

              Child      Adult    Elderly      Total
Survived  53.982301  38.541667  26.923077  40.559441
Died      46.017699  61.458333  73.076923  59.440559

In [10]:
survived = {"S": 0, "C": 0, "Q": 0, "U": 0}
died = {"S": 0, "C": 0, "Q": 0, "U": 0}
for idx in range(len(df)):
    city = df.loc[idx, "Embarked"]
    if df.loc[idx, "Survived"] == 1:
        if city in ["S", "C", "Q"]:
            survived[city] += 1
        else:
            survived["U"] += 1
    else:
        if city in ["S", "C", "Q"]:
            died[city] += 1
        else:
            died["U"] += 1
            
conTable = {
    "S": [survived["S"], died["S"], survived["S"] + died["S"]],
    "Q": [survived["Q"], died["Q"], survived["Q"] + died["Q"]],
    "C": [survived["C"], died["C"], survived["C"] + died["C"]],
    "U": [survived["U"], died["U"], survived["U"] + died["U"]],
    "Total": [sum(survived.values()), sum(died.values()), len(df)]
}

conTable = pd.DataFrame(conTable)
conTable.index = ["Survived", "Died", "Total"]
conTable.head()

            S   Q    C  U  Total
Survived  217  30   93  2    342
Died      427  47   75  0    549
Total     644  77  168  2    891